server/artilleryTest.yml
config:
  local:
  target: "http://localhost:3000"
  phases:
  - duration: 60
    arrivalRate: 10
defaults:
  headers:
    content-type: "application/json"
plugins:
  expect: {}
scenarios:
  - name: "Get Questions"
    flow:
      - get:
          url: "/qa/questions?productId=2&page=0&count=5"
      - think: 1
  - name: "Get Answers"
    flow:
      - get:
          url: "/qa/questions/11/answers?page=0&count=5"
      - think: 1